Soar_EnvGen/cfd/wind_around_buildings_tutorial/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          200;
        startFace       668351;
    }
    outlet
    {
        type            patch;
        nFaces          200;
        startFace       668551;
    }
    ground
    {
        type            wall;
        inGroups        1(wall);
        nFaces          6413;
        startFace       668751;
    }
    frontAndBack
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          1000;
        startFace       675164;
    }
    buildings
    {
        type            wall;
        inGroups        1(wall);
        nFaces          33340;
        startFace       676164;
    }
)

// ************************************************************************* //
