Soar_EnvGen/cfd/wind_around_buildings_tutorial/Allrun.pre
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

mkdir -p constant/triSurface

# cp -f \
#     "$FOAM_TUTORIALS"/resources/geometry/buildings.obj.gz \
#     constant/triSurface/

cp -f constant/buildings.obj constant/triSurface/

runApplication surfaceFeatureExtract

runApplication blockMesh

runApplication snappyHexMesh -overwrite

#------------------------------------------------------------------------------
